# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

Â© Explore Data Science Academy

### Honour Code

I {Christinah, Chokwe}, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

The Bhejane trading store is an online retailer specialising in Covid essential items. The store has recently been struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the database, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.  

Though the normalisation process, you will be guided into acknowledging client (Bhenjane Trading) use-cases for the database, and dealing with data anomalies in SQL.

![Bhejane company logo](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Bhejane.png)

<div align="center" >
    Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [2]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

The `Product` table consists of the stock of all inventory that Bhejane has on hand currently, or has had on hand historically. Items which are in this table are able to be purchased, and a record of all sales (transactions) in 2020 is notorised in the `Transactions` table. To link the tables - the `barcode` can be used. Any item in the `Transactions` table, must therefore appear in the `Products` table.

In [3]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

,Table Name,Column Name,Desciption
0,Products,Width,Width of the product once assembled
1,Products,Length,Length of the product once assembled
2,Products,Height,Height of the product once assembled
3,Products,Barcode,The unique product identifier
4,Products,Quantity,Number of goods in stock
5,Products,Brand,Product brand name relating to product company
6,Products,NavigationPath,Navigation path to specific product
7,Products,Colour,Name default colour for the product
8,Products,StockCountry,Country where the stock was bought from
9,Products,ProductDescription,Descriptive product name
10,Products,PackType,The way in which the product is packaged
11,Products,Volume_litre,The quantity of liquid based products
12,Products,Warranty,Product warranty type
13,Products,Weight_kg,Weight of the product
14,Products,ItemDescription,Description of contents of the package
15,Products,Price,The cost of the product in Rands
16,Transactions,CartID,Identifies an individual basket from a user pu...
17,Transactions,Barcode,Barcode for item that user purchased
18,Transactions,Total,Total value of a transaction
19,Transactions,UserName,Name of customer purchasing stock
20,Transactions,InvoiceDate,Date on which the product was bought

<a id='Setting_up'></a>
### 4. Setting up the database

In [5]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [77]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150),
    "Quantity" REAL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150),
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 04:16:42 PM South Africa Standard Time; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

Although we have not yet covered python in the sprint at EXPLORE - you have additional resources at your disposal, one of which happens to be a data engineering expert, and she has created a brief script for you which can be used to extract the data from the csv files, and load it into a sqlite database. 

This will be included in your submission, so that the end-to-end processing of the data is visible, and repeatable for any additional consultants who may be brought on board at a later stage.

In [78]:
# DO NOT EDIT CELL
#Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [8]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT * FROM Products
LIMIT 2;

Query started at 03:39:53 PM South Africa Standard Time; Query executed in 0.00 m

,Width,Length,Height,Barcode,Quantity,Brand,NavigationPath,Colour,StockCountry,ProductDescription,PackType,Volume_litre,Warranty,Weight_kg,ItemDescription,Price
0,,,,300507946,493.0,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,1 x Hikvision 1080P Bullet camera,399.0
1,,,,300507946,493.0,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,Manual,399.0

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

![1st Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1stNF.png)


It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [79]:
%%read_sql
--#Create tables required for 1NF
DROP TABLE IF EXISTS "Products_1NF";
DROP TABLE IF EXISTS "Transactions_1NF";

CREATE TABLE "Products_1NF"(
    "Barcode" VARCHAR(150),
    "NavigationPath" VARCHAR(150),
    "ItemDescription" VARCHAR(150),
    "Colour" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    PRIMARY KEY("Barcode","NavigationPath","ItemDescription")
);

CREATE TABLE "Transactions_1NF" (
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    FOREIGN KEY ("Barcode") REFERENCES "Products_1NF" ("Barcode"),
    PRIMARY KEY("CartID", "Barcode", "UserName")
);

Query started at 04:17:10 PM South Africa Standard Time; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [80]:
%%read_sql
--#Populate the 1NF tables
DELETE FROM "Products_1NF";
DELETE FROM "Transactions_1NF";

INSERT INTO "Products_1NF" ("Barcode","NavigationPath","ItemDescription","Colour","ProductDescription","Brand",
                            "Price","Quantity","PackType","Warranty","StockCountry","Weight_kg",
                            "Volume_litre","Length","Width","Height")
SELECT DISTINCT
     Barcode
    ,NavigationPath
    ,ItemDescription
    ,Colour
    ,ProductDescription
    ,Brand
    ,Price
    ,Quantity
    ,PackType
    ,Warranty
    ,StockCountry
    ,Weight_kg
    ,Volume_litre
    ,Length
    ,Width
    ,Height 
FROM 
    Products;

INSERT INTO "Transactions_1NF"("CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID
    ,Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions;

Query started at 04:17:19 PM South Africa Standard Time; Query executed in 0.01 m

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

#### 7.1 Entity Relationship Diagram

![2nd Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2ndNF.png)

#### 7.2 2NF Requirements
To transition from 1NF to 2NF, we need all columns in all tables to not have a partial dependancy on the PK of the table. This means that any tables which have a composite key e.g. `PRIMARY KEY("Barcode","NavigationPath","ItemDescription")` cannot have columns in the table which are dependant on only `Barcode`, `NavigationPath`, or `ItemDescription`. 

In moving to 2NF we will seperate out each of these as a primary key (for their own respective tables), and any columns dependant on one of these columns but not the others, will go into that table. The only columns remaining in the tables will be fully functionally dependant on the primary key of the table. For example, 

Thereby, we remove the partial dependancy, and will be in 2NF. We are instructed to create a unique identifier for the `Transactions_2NF`. 

**Second normal form notes**

<br>$\bullet$ Notice that `Total` is only dependant on `CartID` and not on `<CartID,barcode>`. This is a partial dependancy
<br>$\bullet$ Second normal form required no *partial functional dependancy* on the key. 
<br>$\bullet$ This can be achieved in 2 ways: create a unique identifier per row (so that there is a simple primary key), or break the table up into only the columns which are fully dependant on the composite key. 
<br>$\bullet$ We are going to opt for the easier solution, and create a unique simple primary key on the `Transactions_1NF`. We can create a unique primary key by concatenating `CartID||barcode`
<br>$\bullet$ NB - this approach does make it more challenging to get into 3NF! Which would be a good argument to opt for the latter approach.

#### 7.3 Data Anomalies

You may stumble into an error when you insert the data which violates this constraint. You query this with the data owner, and you are told that there are three transactions in the database which were errors. You are informed that *all transactions in the database correspond to products are in the database*.

These entries were captured incorrectly, and must be removed. How will you deal with this?

In [81]:
%%read_sql
select count(distinct barcode) from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 04:17:37 PM South Africa Standard Time; Query executed in 0.01 m

   count(distinct barcode)
0                        2

In [82]:
%%read_sql
SELECT barcode FROM Transactions_1NF WHERE barcode NOT IN (SELECT barcode FROM products_1NF );

Query started at 04:17:45 PM South Africa Standard Time; Query executed in 0.00 m

         Barcode
0   889899982693
1  6007226069631
2  6007226069631

### <font color='turquoise'>Action: remove the affected entries with a `delete` query </font>

In [83]:
%%read_sql
delete from Transactions_1NF WHERE barcode = '889899982693' OR barcode = '6007226069631';

Query started at 04:17:54 PM South Africa Standard Time; Query executed in 0.00 m

In [84]:
%%read_sql
-- Should show no entries!
select count(distinct barcode) from Transactions_1NF where barcode not in (select barcode from products_1NF)

Query started at 04:17:56 PM South Africa Standard Time; Query executed in 0.00 m

   count(distinct barcode)
0                        0

#### 7.4 FK Requirements

_Note: sqlite does not always enforce foreign key constraints (and it is even more inconsistent with magic commands to enforce FK constraints!), so it is critical that you understand the purpose of the foreign key constraint and therefore are able to enforce the FK constraint yourself!_

To enforce data integrity, and to ensure that strange things cannot happen - we will have a FK constraint. A foreign key forces all values of the FK, to be limited to only the values which exist as entries in the PK column of the table for which the aforementioned table is a foreign key to. For example, we cannot sell a product (in our Transactions table) which we do not have in our Products table. 

You will need to work around this by removing the erroneous data from the tables before continuing, since this would violate the FK constraint between the Transactions_2NF and Products_2NF table otherwise. 

_Hint: Identify the observations in the Transactions_1NF table, and remove them from there._

#### 7.5 Client Use-Case Requirements

The data owner has advised that there were several instances of incorrect data capturing. Whenever data was partially captured, it was redone, but the partially-complete entries have not been removed from the database. 

For all tables which are going to be used, consider the table utility relative to the Products (Products_2NF) table. You are tasked with removing 'useless' entries as you take the data from 1NF to 2NF. For the sake of ease-of-use for the client, we will removing all rows in the 2NF tables `PackageContents_2NF` and `Colours_2NF` which have an empty value for the attributes that the client will use them for - these are the `ItemDescription` and `Colour` columns, respectively. 

_Hint: Make inserts into the other 2NF (`PackageContents_2NF` and `Colours_2NF`) tables using a `where` clause to remove instances of the value being an empty string, or a `null` value. This will need to be considered for the `ItemDescription` and for the `Colour` when data is inserted into the corresponding tables above (i.e. only insert data into the `PackageContents_2NF` which has a value for the `ItemDescription`, and only insert data into the `Colours_2NF` table which has a value for `Colour`_

### <font color='turquoise'>Action: Investigate these anomalies for the tables mentioned </font>

In [85]:
%%read_sql 

SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty,
    colour
FROM
    Products
WHERE Colour = '';

Query started at 04:18:06 PM South Africa Standard Time; Query executed in 0.00 m

,ItemDescription,PackType,Warranty,Colour
0,1 x Hikvision 1080P Bullet camera,,Limited (6 months),
1,Manual,,Limited (6 months),
2,,,Limited (12 months),
3,1 x 350ml Free Air Duster,,Limited (6 months),
4,Wahl Home Pro Basic Corded 8 Piece Haircutting...,,Limited (6 months),
...,...,...,...,...
297,1 x Tea Tree,,Limited (6 months),
298,1 x Sweet Orange,,Limited (6 months),
299,1 x Rosemary,,Limited (6 months),
300,1 x Peppermint,,Limited (6 months),
301,1 x UPS,,Limited (12 months),

In [22]:
%%read_sql 

SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty,
    colour
FROM
    Products
WHERE ItemDescription = '';

Query started at 06:07:47 PM South Africa Standard Time; Query executed in 0.00 m

   ItemDescription PackType              Warranty  Colour
0                              Limited (6 months)    Grey
1                                  Non-Returnable  Fresco
2                             Limited (12 months)
3                              Limited (6 months)
4                              Limited (6 months)   White
5                             Limited (12 months)   Black
6                                  Non-Returnable
7                            Limited (120 months)
8                            Limited (180 months)
9                                  Non-Returnable   Black
10                            Limited (18 months)
11                           Supplier (12 months)   Black
12                                 Non-Returnable   White
13                             Limited (6 months)   Black
14                   Single    Limited (6 months)
15                            Limited (24 months)    Blue
16                            Limited (24 months)     Red
17                            Limited (12 months)   Green
18                             Limited (6 months)  Silver
19
20                            Limited (12 months)   White
21                            Limited (24 months)
22                            Limited (24 months)   White
23                             Limited (6 months)    Blue
24                            Limited (36 months)   Black
25                                Full (6 months)
26                            Limited (24 months)   Black

### Let's do it! Construct the database above in second normal form

In [86]:
%%read_sql
--#Create tables required for 2NF

DROP TABLE IF EXISTS "Products_2NF";
DROP TABLE IF EXISTS "Transactions_2NF";
DROP TABLE IF EXISTS "Navigation_2NF";
DROP TABLE IF EXISTS "PackageContents_2NF";
DROP TABLE IF EXISTS "Colours_2NF";

CREATE TABLE Products_2NF(
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Brand" VARCHAR(150),
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "StockCountry" VARCHAR(150),
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    PRIMARY KEY(RegistryID AUTOINCREMENT),
    CONSTRAINT fk_nav FOREIGN KEY('PathID') REFERENCES Navigation_2NF ('PathID'),
    CONSTRAINT fk_pack FOREIGN KEY('ItemID') REFERENCES PackageContents_2NF ('ItemID'),
    CONSTRAINT fk_col FOREIGN KEY('ColourID') REFERENCES Colours_2NF ('ColourID') 
);

CREATE TABLE "Transactions_2NF" (
    "CartID||Barcode||UserName" VARCHAR(150) NOT NULL,
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    PRIMARY KEY("CartID||Barcode||UserName")
    CONSTRAINT fk_trans FOREIGN KEY('Barcode') REFERENCES Products_2NF ('Barcode')
);


CREATE TABLE "Navigation_2NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);

CREATE TABLE "Colours_2NF"(
    "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
);

CREATE TABLE "PackageContents_2NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);

Query started at 04:18:18 PM South Africa Standard Time; Query executed in 0.00 m

### Let's do it! _Populate_ the database above in second normal form

Firstly, let's consider the entries which are `null` and `= ''`. And we will only insert the relevant entries.

In [87]:
%%read_sql
-- #Populate the tables so that they conform to 2NF

DELETE FROM "Products_2NF";
DELETE FROM "Transactions_2NF";
DELETE FROM "Navigation_2NF";
DELETE FROM "PackageContents_2NF";
DELETE FROM "Colours_2NF";


INSERT INTO "Navigation_2NF"("NavigationPath")
SELECT DISTINCT 
    NavigationPath 
FROM
    Products_1NF;
    
INSERT INTO "PackageContents_2NF"("ItemDescription","PackType","Warranty")
SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products_1NF
WHERE ItemDescription <> ''
        ;
    
INSERT INTO "Colours_2NF"("Colour")
SELECT DISTINCT 
    Colour
FROM
    Products_1NF
WHERE Colour <> ''
        ;

Query started at 04:18:24 PM South Africa Standard Time; Query executed in 0.00 m

A more complicated scenario below as we insert into `Products_2NF`. We will insert from the Products_1NF table. We can use LEFT JOIN, because the data in each of these tables that `Products_1NF` has a FK to, originally came from `Products_1NF`, so we are gauranteed to get matches back. Normally however, what you would get from the FK restriction is the requirement to use _parent-table_ `LEFT JOIN` _child-table_.

In [88]:
%%read_sql 

INSERT INTO "Products_2NF" ("PathID","ItemID","ColourID","Barcode","ProductDescription","Brand","Price",
                            "Quantity","StockCountry","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    PathID,
    ItemID,
    ColourID,
    Products_1NF.Barcode,
    ProductDescription,
    Brand,
    Price,
    Quantity,
    StockCountry,
    Weight_kg, 
    Volume_litre, 
    Length,
    Width,
    Height 
FROM 
    Products_1NF
LEFT JOIN Navigation_2NF ON Products_1NF.NavigationPath = Navigation_2NF.NavigationPath 
LEFT JOIN PackageContents_2NF ON Products_1NF.ItemDescription = PackageContents_2NF.ItemDescription
LEFT JOIN Colours_2NF ON Products_1NF.Colour = Colours_2NF.Colour

Query started at 04:18:32 PM South Africa Standard Time; Query executed in 0.01 m

Last but not least, we insert into the `Transactions_2NF`table. Recall that we created a new PK in this table, and pay attention to how we are inserting values into the table.

In [89]:
%%read_sql 

INSERT INTO "Transactions_2NF"("CartID||Barcode||UserName","CartID","Barcode","UserName","InvoiceDate","Total")
SELECT DISTINCT 
    CartID||Transactions_1NF.Barcode||UserName
    ,CartID
    ,Transactions_1NF.Barcode
    ,UserName
    ,InvoiceDate
    ,Total
FROM
    Transactions_1NF
LEFT JOIN Products_2NF ON Transactions_1NF.Barcode = Products_2NF.Barcode ;

Query started at 04:18:40 PM South Africa Standard Time; Query executed in 0.16 m

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch. In the same fashion as done in 2NF, note which tables need to have data inserted `where column <> '' and column is not null`.

<br>

![3rd Normal Form](https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3rdNF.png)

In [123]:
%%read_sql

--#Create tables required for 2NF
DROP TABLE IF EXISTS "Transactions_3NF";
DROP TABLE IF EXISTS "Carts_3NF";
DROP TABLE IF EXISTS "Products_3NF";
DROP TABLE IF EXISTS "Users_3NF";
DROP TABLE IF EXISTS "Navigation_3NF";
DROP TABLE IF EXISTS "PackageContents_3NF";
DROP TABLE IF EXISTS "Colours_3NF";
DROP TABLE IF EXISTS "Brands_3NF";
DROP TABLE IF EXISTS "Locations_3NF";

CREATE TABLE "Products_3NF" (
    "RegistryID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "ProductDescription" VARCHAR(150) NOT NULL,
    "Price" REAL NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Weight_kg" REAL,
    "Volume_litre" REAL,
    "Length" REAL,
    "Width" REAL,
    "Height" REAL,
    "PathID" INTEGER,
    "ItemID" INTEGER,
    "ColourID" INTEGER,
    "BrandID" INTEGER,
    "LocationID" INTEGER,
    PRIMARY KEY("RegistryID" AUTOINCREMENT),
    FOREIGN KEY("PathID") REFERENCES "Navigation_3NF" ("PathID"),
    FOREIGN KEY("ItemID") REFERENCES "PackageContents_3NF" ("ItemID"),
    FOREIGN KEY("ColourID") REFERENCES "Colours_3NF" ("ColourID") ,
    FOREIGN KEY ("BrandID") REFERENCES "Brands_3NF" ("BrandID"),
    FOREIGN KEY ("LocationID") REFERENCES "Locations_3NF" ("LocationID")
);


CREATE TABLE "Carts_3NF" (
    "CartID" INTEGER NOT NULL,
    "InvoiceDate" DATETIME NOT NULL,
    "Total" REAL NOT NULL,
    PRIMARY KEY ("CartID")
);


CREATE TABLE "Users_3NF"(
    "UserID" INTEGER NOT NULL,
    UserName VARCHAR(50) NOT NULL,
    PRIMARY KEY("UserID" AUTOINCREMENT)
);

Query started at 05:51:04 PM South Africa Standard Time; Query executed in 0.01 m

### <font color='turquoise'>Action: proceed with the construction of the remaining tables mentioned </font>

In [124]:
%%read_sql

CREATE TABLE "Transactions_3NF" (
    "CartID||Barcode||UserName" VARCHAR(150) NOT NULL,
    "CartID" INTEGER NOT NULL,
    "Barcode" VARCHAR(150) NOT NULL,
    "UserName" VARCHAR(150) NOT NULL,
    PRIMARY KEY("CartID||Barcode||UserName")
    CONSTRAINT fk_Cart FOREIGN KEY("CartID") REFERENCES "Products_3NF" ("CartID")
    CONSTRAINT fk_Bar FOREIGN KEY("Barcode") REFERENCES "Products_3NF" ("Barcode")
    CONSTRAINT fk_user FOREIGN KEY("UserName") REFERENCES "Products_3NF" ("UserName")
);

    
CREATE TABLE "Navigation_3NF"(
    "PathID" INTEGER NOT NULL,
    "NavigationPath" VARCHAR(150),
    PRIMARY KEY("PathID" AUTOINCREMENT)
);
                

CREATE TABLE "PackageContents_3NF"(
    "ItemID" INTEGER NOT NULL,
    "ItemDescription" VARCHAR(150),
    "PackType" VARCHAR(150),
    "Warranty" VARCHAR(150),
    PRIMARY KEY("ItemID" AUTOINCREMENT)
);


CREATE TABLE "Colours_3NF"(
     "ColourID" INTEGER NOT NULL,
    "Colour" VARCHAR(150),
    PRIMARY KEY("ColourID" AUTOINCREMENT)
);


CREATE TABLE "Brands_3NF"(
    "BrandID" INTEGER NOT NULL,
    "Brand" VARCHAR (150),
    PRIMARY KEY ("BrandID" AUTOINCREMENT)
);

    
CREATE TABLE "Locations_3NF"(
    "LocationID" INTEGER NOT NULL,
    "StockCountry" VARCHAR (150),
    PRIMARY KEY ("LocationID" AUTOINCREMENT)
);

Query started at 05:51:13 PM South Africa Standard Time; Query executed in 0.00 m

In [125]:
%%read_sql

--# Populate the tables to that they conform to the 3rd Normal Form
DELETE FROM "Products_3NF";
DELETE FROM "Transactions_3NF";
DELETE FROM "Carts_3NF";
DELETE FROM "Users_3NF";
DELETE FROM "Navigation_3NF";
DELETE FROM "PackageContents_3NF";
DELETE FROM "Colours_3NF";
DELETE FROM "Brands_3NF";
DELETE FROM "Locations_3NF";

INSERT INTO "Users_3NF" ("UserName")
SELECT DISTINCT UserName FROM Transactions_2NF;

Query started at 05:51:19 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Carts_3NF`.   </font>

Take note that there are duplicate values coming from `Transactions_2NF` - retain the `distinct` combinations of `CartID`,`InvoiceDate`,`Total` only.

In [62]:
%%read_sql
SELECT *
FROM Products_2NF
LIMIT 5;

Query started at 03:50:58 PM South Africa Standard Time; Query executed in 0.02 m

,RegistryID,Barcode,ProductDescription,Brand,Price,Quantity,StockCountry,Weight_kg,Volume_litre,Length,Width,Height,PathID,ItemID,ColourID
0,1,300507946,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,Hikvision,399.0,493,,,0.0,,,,11,1.0,NaN
1,2,300507946,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,Hikvision,399.0,493,,,0.0,,,,11,2.0,NaN
2,3,10325354918,ZEE 3-in-1 Unisex Gaiter,ZEE,139.0,467,,,0.0,,,,1,NaN,1.0
3,4,27131187035,Estee Lauder Double Wear Stay In Place Makeup,Estee Lauder,655.0,275,South Africa,,0.0,,,,8,NaN,2.0
4,5,27131187035,Estee Lauder Double Wear Stay In Place Makeup,Estee Lauder,655.0,275,South Africa,,0.0,,,,9,NaN,2.0

In [126]:
%%read_sql

INSERT INTO "Carts_3NF"("CartID","InvoiceDate","Total")
SELECT DISTINCT CartID, InvoiceDate, Total FROM Transactions_2NF;

Query started at 05:51:29 PM South Africa Standard Time; Query executed in 0.01 m

### <font color='turquoise'>Action: proceed with the insertion into the tables below. </font>

Similarly to the table above, mind the occurances of duplicate entries. These can be avoided by using `SELECT distinct` to avoid inserting redundant rows.

In [66]:
%%read_sql
SELECT *
FROM Colours_2NF
LIMIT 2;

Query started at 04:05:21 PM South Africa Standard Time; Query executed in 0.00 m

   ColourID  Colour
0         1    Grey
1         2  Fresco

In [127]:
%%read_sql

INSERT INTO "Locations_3NF"("StockCountry")
SELECT DISTINCT 
    StockCountry 
FROM Products_2NF
WHERE StockCountry <> '';


INSERT INTO "Brands_3NF"("Brand")
SELECT DISTINCT 
    Brand 
FROM Products_2NF
WHERE Brand <> '';

INSERT INTO "Colours_3NF"("Colour")
SELECT DISTINCT 
    Colour
FROM Products_1NF
WHERE Colour <> '';


INSERT INTO "PackageContents_3NF"("ItemDescription","PackType","Warranty")
SELECT DISTINCT 
    ItemDescription,
    PackType,
    Warranty 
FROM
    Products_1NF
WHERE ItemDescription <> '';


INSERT INTO "Navigation_3NF"("NavigationPath")
SELECT DISTINCT  
    NavigationPath
FROM Products_1NF;

Query started at 05:51:40 PM South Africa Standard Time; Query executed in 0.00 m

### <font color='turquoise'>Action: proceed with the insertion into `Products_3NF`. </font>
Take note of the joins required for additional data contained in other tables.

In [105]:
%%read_sql
SELECT *
FROM Products_2NF
LIMIT 2;

Query started at 05:27:00 PM South Africa Standard Time; Query executed in 0.00 m

,RegistryID,Barcode,ProductDescription,Brand,Price,Quantity,StockCountry,Weight_kg,Volume_litre,Length,Width,Height,PathID,ItemID,ColourID
0,1,300507946,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,Hikvision,399.0,493,,,0.0,,,,11,1,None
1,2,300507946,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,Hikvision,399.0,493,,,0.0,,,,11,2,None

In [128]:
%%read_sql

INSERT INTO "Products_3NF" ("PathID","ItemID","ColourID","BrandID","LocationID",
                            "Barcode","ProductDescription","Price",
                            "Quantity","Weight_kg","Volume_litre",
                            "Length","Width","Height")
SELECT
    PathID,
    ItemID,
    ColourID,
    BrandID,
    LocationID,
    Barcode,
    ProductDescription,
    Price,
    Quantity,
    Weight_kg,
    Volume_litre,
    Length,
    Width,
    Height
FROM Products_2NF
LEFT JOIN Brands_3NF ON Products_2NF.Brand = Brands_3NF.Brand
LEFT JOIN Locations_3NF ON Products_2NF.StockCountry = Locations_3NF.StockCountry;

Query started at 05:51:49 PM South Africa Standard Time; Query executed in 0.01 m

### <font color='turquoise'>Action: proceed with the insertion into `Transactions_3NF`.   </font>

Follow previous proceedure, and checks.

In [129]:
%%read_sql

INSERT INTO "Transactions_3NF"("CartID||Barcode||UserName","CartID","Barcode",'UserName')
SELECT
    Transactions_1NF.CartID||Transactions_1NF.Barcode||Transactions_1NF.UserName,
    Transactions_1NF.CartID,
    Transactions_1NF.Barcode,
    Transactions_1NF.UserName
FROM Transactions_1NF
LEFT JOIN Users_3NF ON Transactions_1NF.UserName = Users_3NF.UserName
LEFT JOIN Carts_3NF ON Transactions_1NF.CartID = Carts_3NF.CartID;

Query started at 05:52:31 PM South Africa Standard Time; Query executed in 0.01 m

### <font color='turquoise'>Action: Investigate the DB.   </font>

Note - the tables counts below are what you should arrive at. If you don't, reconsider how you have done the inserts above. Having the tables correctly formatted will allow to answer the questions more easily, and without errors.

In [5]:
%%read_sql
SELECT *
FROM Transactions_3NF
LIMIT 2;

Query started at 11:13:17 AM South Africa Standard Time; Query executed in 0.00 m

  CartID||Barcode||UserName  CartID       Barcode  UserName UserID
0       143859499182Hendrik       1   43859499182   Hendrik      1
1     2614143543746Faristha       2  614143543746  Faristha      2

In [130]:
%%read_sql 

-- How many entries are here in each of the tables in the database now? 
select '3. Products_3NF' as table_name, count(*) from Products_3NF
UNION
select '3. Transactions_3NF' as table_name, count(*) from Transactions_3NF
UNION
select '3. Users_3NF' as table_name, count(*) from Users_3NF
UNION
select '3. Navigation_3NF' as table_name, count(*) from Navigation_3NF
UNION
select '3. PackageContents_3NF' as table_name, count(*) from PackageContents_3NF
UNION
select '3. Colours_3NF' as table_name, count(*) from Colours_3NF
UNION
select '3. Brands_3NF' as table_name, count(*) from Brands_3NF
UNION
select '3. Locations_3NF' as table_name, count(*) from Locations_3NF
UNION
select '3. Carts_3NF' as table_name, count(*) from Carts_3NF

Query started at 05:57:28 PM South Africa Standard Time; Query executed in 0.00 m

               table_name  count(*)
0           3. Brands_3NF       232
1            3. Carts_3NF       190
2          3. Colours_3NF        17
3        3. Locations_3NF         2
4       3. Navigation_3NF       396
5  3. PackageContents_3NF       600
6         3. Products_3NF      1214
7     3. Transactions_3NF       275
8            3. Users_3NF       158

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many unique products does the company have?

In [91]:
%%read_sql
-- Write your query here:
SELECT COUNT(DISTINCT(Barcode))
FROM Products;

Query started at 02:25:26 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(DISTINCT(Barcode))
0                       608

Q2) How many users bought from Bhejane in April 2020?

In [121]:
%%read_sql
-- Write your query here:
SELECT InvoiceDate,COUNT(DISTINCT(UserName))
FROM Transactions_2NF
WHERE InvoiceDate LIKE '2020-04%';

Query started at 04:18:14 PM South Africa Standard Time; Query executed in 0.00 m

          InvoiceDate  COUNT(DISTINCT(UserName))
0  2020-04-14 0:00:00                         31

Q3) How many users bought 3 or more items that cost more than R1000?

In [154]:
%%read_sql
-- Write your query here:
SELECT UserName,Barcode, Total
FROM Transactions_1NF 
WHERE Total > 1000
ORDER BY UserName;

Query started at 05:07:44 PM South Africa Standard Time; Query executed in 0.00 m

         UserName        Barcode    Total
0           Adele  6009706869533   1177.0
1           Adele    HTBG3HG7A86   1177.0
2           Adele  MPTAL00451356   1177.0
3   Andreas Peter    HTB5FI3BC8C   3765.0
4       Anonymous  6005519114211   1999.0
5        Brigette    HTB5ABG31E3  10999.0
6           Cindy   741311301174   1999.0
7          DIMPHO      300507946   1523.0
8          DIMPHO  6002322009727   1523.0
9          DIMPHO  8888021200980   1523.0
10         DIMPHO  MPTAL00215561   1523.0
11          Daffy  4015400541813   1134.0
12          Daffy  6001068495306   1134.0
13          Daffy  MPTAL00404508   1134.0
14          Daffy  MPTAL72134564   1134.0
15          Hanno  4549292118766   1334.0
16          Hanno  6001878010171   1334.0
17          Hanno  MPTAL00215519   1334.0
18         Junaid   619659097318   3301.0
19         Junaid  8809313492623   3301.0
20         Junaid    HTBCGGHCC14   3301.0
21         Junaid  MPTAL00351754   3301.0
22          Karyn   884392580773   1137.0
23          Karyn  6002322014646   1137.0
24          Karyn  MPTAL57567320   1137.0
25         Mandla   718037858494   1351.0
26         Mandla    HTB5ABG31E3  10999.0
27         Mandla  MPTAL00348002   1351.0
28         Mandla  MPTAL00573464   1351.0
29       Margaret   834266002368   1716.0
30       Margaret  6009684040641   1716.0
31       Margaret  8886362979725   1716.0
32       Margaret  MPTAL00031884   1716.0
33            Mel   884392580773   1114.0
34            Mel  6009900463131   1114.0
35            Mel  MPTAL57927480   1114.0
36            Mel  MPTAL72842868   1114.0
37        Melandi  6003000640348   2535.0
38        Melandi  8001841126586   2535.0
39        Melandi    MPTALP14631   2535.0
40        Mzoxolo    HTB5FI3BC8C   3765.0
41         Todani  5397184200193   2299.0
42         Zanele   617566827837   3464.0
43         Zanele    HTBH54I571A   3464.0
44         Zanele  MPTAL72013338   3464.0

In [145]:
%%read_sql
-- Write your query here:
SELECT UserName, Total, Barcode, CartID
FROM Transactions_1NF 
WHERE Total > 1000
GROUP BY UserName
ORDER BY UserName;

Query started at 04:57:51 PM South Africa Standard Time; Query executed in 0.00 m

         UserName    Total        Barcode  CartID
0           Adele   1177.0  6009706869533     139
1   Andreas Peter   3765.0    HTB5FI3BC8C     125
2       Anonymous   1999.0  6005519114211      57
3        Brigette  10999.0    HTB5ABG31E3     124
4           Cindy   1999.0   741311301174       7
5          DIMPHO   1523.0      300507946     102
6           Daffy   1134.0  4015400541813     160
7           Hanno   1334.0  4549292118766     101
8          Junaid   3301.0   619659097318     136
9           Karyn   1137.0   884392580773     114
10         Mandla   1351.0   718037858494     156
11       Margaret   1716.0   834266002368     115
12            Mel   1114.0   884392580773     172
13        Melandi   2535.0  6003000640348     113
14        Mzoxolo   3765.0    HTB5FI3BC8C     126
15         Todani   2299.0  5397184200193      23
16         Zanele   3464.0   617566827837     179

Q4) Which user made the largest purchase on a single transaction?

In [12]:
%%read_sql
-- Write your query here:
SELECT UserName, Total
FROM Transactions
ORDER BY Total DESC
LIMIT 5;

Query started at 11:26:34 AM South Africa Standard Time; Query executed in 0.00 m

        UserName    Total
0         Mandla  10999.0
1       Brigette  10999.0
2  Andreas Peter   3765.0
3        Mzoxolo   3765.0
4         Zanele   3464.0

Q5) How many components does the product: "5m Colour Changing RGB LED Strip Light" (MPTAL57588104) come with?

In [19]:
%%read_sql
-- Write your query here:
SELECT ProductDescription, COUNT(ItemDescription), COUNT(NavigationPath)
FROM Products
WHERE ProductDescription = '5m Colour Changing RGB LED Strip Light';

Query started at 11:34:41 AM South Africa Standard Time; Query executed in 0.07 m

,ProductDescription,COUNT(ItemDescription),COUNT(NavigationPath)
0,5m Colour Changing RGB LED Strip Light,8,8

Q6) How many brands are available at Bhejane?

In [169]:
%%read_sql
-- Write your query here:
SELECT COUNT(DISTINCT(Brand))
FROM Products_2NF;

Query started at 06:21:45 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(DISTINCT(Brand))
0                     233

7) What is the price of the "Verimark - Floorwiz 2in1 Mop"?

In [23]:
%%read_sql
-- Write your query here:
SELECT PRICE, ProductDescription
FROM Products
WHERE ProductDescription = 'Verimark - Floorwiz 2in1 Mop';

Query started at 12:22:32 PM South Africa Standard Time; Query executed in 0.00 m

   Price            ProductDescription
0  179.0  Verimark - Floorwiz 2in1 Mop
1  179.0  Verimark - Floorwiz 2in1 Mop
2  179.0  Verimark - Floorwiz 2in1 Mop

Q8) Calculate the package volume of the "Russell Hobbs - Slow Cooker" using the given dimensions

In [25]:
%%read_sql
-- Write your query here:
SELECT (Width*Height*Length) AS package_volume
FROM Products
WHERE ProductDescription = 'Russell Hobbs - Slow Cooker'
;

Query started at 12:32:35 PM South Africa Standard Time; Query executed in 0.00 m

   package_volume
0         26928.0
1         26928.0
2         26928.0
3         26928.0

Q9) Which user made the most transactions in the Year 2020?

In [39]:
%%read_sql
-- Write your query here:
SELECT COUNT(CartID) AS t, UserName
FROM Transactions
WHERE InvoiceDate LIKE '2020%'
GROUP BY UserName
ORDER BY t DESC
;

Query started at 12:59:23 PM South Africa Standard Time; Query executed in 0.00 m

     t            UserName
0    9            Cornelis
1    8                Erlo
2    6              Zanele
3    6             Heather
4    5              Mandla
..  ..                 ...
155  1  Angelica Fernandez
156  1             Andiswa
157  1   Andisa Moleboheng
158  1              Alicia
159  1             Adeebah

[160 rows x 2 columns]

Q10) What is the total number of users that shop at Bhejane?

In [42]:
%%read_sql
-- Write your query here:
SELECT COUNT(DISTINCT(UserName))
FROM Transactions_2NF;

Query started at 01:09:27 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(DISTINCT(UserName))
0                        158

Q11) What is the record count for the Colours_3NF Table?

In [43]:
%%read_sql
-- Write your query here:
SELECT COUNT(*)
FROM Colours_3NF;

Query started at 01:16:08 PM South Africa Standard Time; Query executed in 0.00 m

   COUNT(*)
0        17

Q12) What would the total price be if I had the following items in my cart?
* MPTAL57588104
* 5000394203921
* 6932391917652

In [159]:
%%read_sql
-- Write your query here:
SELECT SUM(DISTINCT(Price))
FROM Products
WHERE Barcode = 'MPTAL57588104' OR Barcode = '5000394203921' OR Barcode = '6932391917652'

Query started at 05:11:28 PM South Africa Standard Time; Query executed in 0.00 m

   SUM(DISTINCT(Price))
0                 734.0

Q13) What is the barcode of the most sold product?

In [72]:
%%read_sql
-- Write your query here:
SELECT Barcode, COUNT(CartID)
FROM Transactions_2NF
GROUP BY BarCode
ORDER BY COUNT(CartID) DESC;

Query started at 01:49:06 PM South Africa Standard Time; Query executed in 0.00 m

              Barcode  COUNT(CartID)
0       4015400541813              4
1       MPTAL00404857              3
2    HURACANNANOWAVE1              3
3       6009686620537              3
4       6001865825405              3
..                ...            ...
216     5000394020146              1
217     4902505163104              1
218       43859499182              1
219     4210201043577              1
220         300507946              1

[221 rows x 2 columns]

Q14) What are the products of Cornelisâ cart on the 2020-06-28 0:00:00?

In [76]:
%%read_sql
-- Write your query here:
SELECT ProductDescription, ItemDescription, UserName, InvoiceDate
FROM Products_1NF
INNER JOIN Transactions_1NF
USING (Barcode)
WHERE UserName = 'Cornelis' AND InvoiceDate = '2020-06-28 0:00:00';

Query started at 01:53:56 PM South Africa Standard Time; Query executed in 0.00 m

,ProductDescription,ItemDescription,UserName,InvoiceDate
0,Dettol Body Wash - Shower Gel - Original - 600ml,1 X Dettol Original 600ml Shower Gel,Cornelis,2020-06-28 0:00:00
1,Vitality Aloe Vera Gel 100ml,,Cornelis,2020-06-28 0:00:00
2,Vitality Aloe Vera Gel 100ml,,Cornelis,2020-06-28 0:00:00
3,Vitality Aloe Vera Gel 100ml,,Cornelis,2020-06-28 0:00:00
4,Sparq Active Resistance Loop Band - Set of 5 w...,1 x carry case,Cornelis,2020-06-28 0:00:00
5,Sparq Active Resistance Loop Band - Set of 5 w...,5 x resistance bands,Cornelis,2020-06-28 0:00:00
6,Protective Face Shield,1x Headband,Cornelis,2020-06-28 0:00:00
7,Protective Face Shield,1x Visor,Cornelis,2020-06-28 0:00:00

Q15) Which users bought locally produced, black-coloured products on odd-numbered months of the year, and what was the total cost (rounded to the nearest integer) of the carts containing these products?

In [165]:
%%read_sql
-- Write your query here:
SELECT UserName,CartID, Total, Colour, StockCountry, InvoiceDate
FROM Transactions_2NF
INNER JOIN Products_2NF
USING (Barcode)
INNER JOIN Colours_2NF
USING(ColourID)
WHERE StockCountry = 'South Africa' AND Colour = 'Black' AND InvoiceDate LIKE '%01%' OR InvoiceDate LIKE '%03' OR InvoiceDate LIKE '%05%' OR InvoiceDate LIKE '%07' OR InvoiceDate LIKE '%09%'

Query started at 05:29:17 PM South Africa Standard Time; Query executed in 0.00 m

     UserName  CartID    Total  Colour  StockCountry         InvoiceDate
0      Zanele       6    840.0   Black  South Africa  2020-06-01 0:00:00
1      Zanele       6    840.0   Black  South Africa  2020-06-01 0:00:00
2      Zanele       6    840.0   Black  South Africa  2020-06-01 0:00:00
3      Zanele       6    840.0   Black  South Africa  2020-06-01 0:00:00
4    lebogang     118    386.0   White                2020-05-01 0:00:00
5    Cornelis      11    459.0   White  South Africa  2020-05-19 0:00:00
6       Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
7       Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
8       Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
9       Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
10      Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
11       Lyle      22     81.0    Gold                2020-08-05 0:00:00
12     Johann      27    124.0   Black                2020-08-09 0:00:00
13        Neo     187    757.0   White  South Africa  2020-05-15 0:00:00
14    Cornell      34     99.0   White  South Africa  2020-05-01 0:00:00
15    Cornell      34     99.0   White  South Africa  2020-05-01 0:00:00
16      Hanno     101   1334.0   White  South Africa  2020-06-09 0:00:00
17     Janine      44     13.0   Brown  South Africa  2020-05-08 0:00:00
18      Karyn     114   1137.0  Silver  South Africa  2020-05-31 0:00:00
19   Clodeane      47    815.0  Silver  South Africa  2020-05-15 0:00:00
20   Clodeane      47    815.0  Silver  South Africa  2020-05-15 0:00:00
21       Theo      50    249.0   White  South Africa  2020-05-21 0:00:00
22    Leonard      59    899.0   Black                2020-05-23 0:00:00
23     shamil      64     52.0     Red  South Africa  2020-07-09 0:00:00
24     shamil      64     52.0     Red  South Africa  2020-07-09 0:00:00
25     shamil      64     52.0     Red  South Africa  2020-07-09 0:00:00
26     shamil      64     52.0     Red  South Africa  2020-07-09 0:00:00
27     Claire      65    275.0   Brown  South Africa  2020-05-02 0:00:00
28    Monique      72    499.0   White  South Africa  2020-05-21 0:00:00
29    Monique      72    499.0   White  South Africa  2020-05-21 0:00:00
30    Monique      72    499.0   White  South Africa  2020-05-21 0:00:00
31     Mandla      77    589.0  Bronze  South Africa  2020-04-09 0:00:00
32      Carel      82    799.0   Black  South Africa  2020-05-04 0:00:00
33      Carel      82    799.0   Black  South Africa  2020-05-04 0:00:00
34      Carel      82    799.0   Black  South Africa  2020-05-04 0:00:00
35      Carel      82    799.0   Black  South Africa  2020-05-04 0:00:00
36      Carel      82    799.0   Black  South Africa  2020-05-04 0:00:00
37      Beryl      83    329.0   Black                2020-05-18 0:00:00
38      Beryl      83    329.0   Black                2020-05-18 0:00:00
39      Beryl      83    329.0   Black                2020-05-18 0:00:00
40      Lacin      85    798.0   Black  South Africa  2020-05-18 0:00:00
41      Lacin      85    798.0   Black  South Africa  2020-05-18 0:00:00
42      Lacin      85    798.0   Black  South Africa  2020-05-18 0:00:00
43   lebogang     118    386.0   White                2020-05-01 0:00:00
44    Willard     117    617.0    Blue                2020-06-05 0:00:00
45   Brigette     124  10999.0   Black                2020-05-30 0:00:00
46  Melokuhle      99    816.0   Black                2020-05-16 0:00:00
47        Neo     187    757.0   Black                2020-05-15 0:00:00
48      Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
49      Hanno     101   1334.0   Black  South Africa  2020-06-09 0:00:00
50       Hugo     150    794.0  Bronze                2020-05-01 0:00:00
51       Hugo     150    794.0  Bronze                2020-05-01 0:00:00
52     justin     175    400.0   White                2020-05-22 0:00:00
53     justin     175    400.0   White                2020-05-22 0:00:00
54    sayidah     107    467.0   White                2020-05-03 0:00:00
55       Paul     186     50.0   White                2020-05-13 0:00:00
56        Neo     187    757.0   Black                2020-05-15 0:00:00
57     Eathon     191     53.0   Black                2020-05-14 0:00:00
58     Eathon     191     53.0   Black                2020-05-14 0:00:00